# 홍길동의 엘지전자 경력 : staff['홍길동']['경력']['엘지전자']
# 홍길동의 취미 중 '자전거': staff['홍길동']['취미'][-1]
# 홍길동의 취미 중 독서가 있는지 판단 : '독서' in staff['홍길동']['취미']

'''
staff = {
    '홍길동' : {
        '직책' : '매니저',
        '연봉' : 200,000,000,
        '경력' : {
            '삼성전자' : 5,
            '엘지전자' : 3,
            'sk' : 10
        },
        '취미' : ['낚시', '헬스', '수영', '자전거']
    }
}
'''

'''
학생이 가지는 과목이 3과목이고 국어 영어 수학 이렇게 점수를 관리
student1 = [100,80,95]
student2 = [90,85,90]
student3 = {'국어' : 100, '영어' : 100, '수학' : 100}
student4 = {'영어' : 100, '국어' : 100, '수학' : 100}
student4 = {'수학' : 100, '영어' : 100, '국어' : 100}
element_class = [student3, student4, student5]

total_math = 0
for student in element_class :
    total_math += student['수학']
'''